org/2021/lose-love-for-coding.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 丧失写代码的激情

写代码明明那么有成就感的事情，我仅仅接触了一年多，我觉得自己还能做这件事很长时间。但准备找工作时，我却胆怯了。胡思乱想让我停步不前，我不该如此。

看到 @reuixiy[fn:1]做了一个好玩的页面：中间是一个一等大的圆，它会发出水中涟漪那样的波纹；围着它的是四个二等大的圆，四个圆连起来就是一个正方形；每个二等圆上都有五个或三个圆，圆上是一些特别的图案。当然，一等圆和二等圆表面也有图案，但没有最小的那些圆上的图案丰富。

这是一种怎样奇妙的构思！这幅图画象征着某种中心化的思想，虽然各子系统都有自己的中心，但是它们又以一等圆作为共同的中心。既是几何的美感，也是一种哲学思考的具象展现。

我为自己的踌躇感到羞愧，不该如此。如果我真的喜爱代码，真心觉得它能够带给我快乐、带来我所需要的大部分。我就应该义无反顾地沉进去，我要对自己说：

高天贺，你不该敷衍自己，你是热爱这件事的。我深知这一点。所以，不要老是在大门口晃悠，行吗？步入编程的殿堂吧，让它带你从技术的角度审视这个世界，认识世界，认识你自己。

[fn:1] https://io-oi.me/tech/circles-animation/